apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_sdmmc.c
static void esp32s3_waitenable(struct sdio_dev_s *dev,
                               sdio_eventset_t eventset, uint32_t timeout);
static sdio_eventset_t esp32s3_eventwait(struct sdio_dev_s *dev);
static void esp32s3_callbackenable(struct sdio_dev_s *dev,
                                   sdio_eventset_t eventset);
static int  esp32s3_registercallback(struct sdio_dev_s *dev,
                                     worker_t callback, void *arg);

/* DMA */

#ifdef CONFIG_ESP32S3_SDMMC_DMA
static int  esp32s3_dmarecvsetup(struct sdio_dev_s *dev, uint8_t *buffer,
                                 size_t buflen);
static int  esp32s3_dmasendsetup(struct sdio_dev_s *dev,
                                 const uint8_t *buffer, size_t buflen);
#endif

/* Initialization/uninitialization/reset ************************************/

static void esp32s3_callback(void *arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

struct esp32s3_dev_s g_sdiodev =
{
  .dev =
  {
#ifdef CONFIG_SDIO_MUXBUS
    .lock             = esp32s3_lock,
#endif
    .reset            = esp32s3_reset,
    .capabilities     = esp32s3_capabilities,
    .status           = esp32s3_status,
    .widebus          = esp32s3_widebus,
    .clock            = esp32s3_clock,
    .attach           = esp32s3_attach,
    .sendcmd          = esp32s3_sendcmd,
#ifdef CONFIG_SDIO_BLOCKSETUP
    .blocksetup       = esp32s3_blocksetup,
#endif
    .recvsetup        = esp32s3_recvsetup,
    .sendsetup        = esp32s3_sendsetup,
    .cancel           = esp32s3_cancel,
    .waitresponse     = esp32s3_waitresponse,
    .recv_r1          = esp32s3_recvshortcrc,
    .recv_r2          = esp32s3_recvlong,
    .recv_r3          = esp32s3_recvshort,
    .recv_r4          = esp32s3_recvshort,
    .recv_r5          = esp32s3_recvshortcrc,
    .recv_r6          = esp32s3_recvshortcrc,
    .recv_r7          = esp32s3_recvshort,
    .waitenable       = esp32s3_waitenable,
    .eventwait        = esp32s3_eventwait,
    .callbackenable   = esp32s3_callbackenable,
    .registercallback = esp32s3_registercallback,
#ifdef CONFIG_ESP32S3_SDMMC_DMA
    .dmarecvsetup     = esp32s3_dmarecvsetup,
    .dmasendsetup     = esp32s3_dmasendsetup,
#endif
  },
  .waitsem = SEM_INITIALIZER(0),
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_getreg
 *
 * Description:
 *   This function may to used to intercept an monitor all register accesses.
 *   Clearly this is nothing you would want to do unless you are debugging
 *   this driver.
 *
 * Input Parameters:
 *   addr - The register address to read
 *
 * Returned Value:
 *   The value read from the register
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SDMMC_REGDEBUG
static uint32_t __esp32s3_getreg(const char *func, uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval   = 0;
  static uint32_t count    = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              mcerr("%s: ...\n", func);
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

      if (count > 3)
        {
          /* Yes.. then show how many times the value repeated */

          mcerr("%s: [repeats %d more times]\n", func, count - 3);
        }

      /* Save the new address, value, and count */

      prevaddr = addr;
      preval   = val;
      count    = 1;
    }

  /* Show the register value read */

  mcerr("%s: %08x->%08x\n", func, addr, val);
  return val;
}
#endif

/****************************************************************************
 * Name: esp32s3_putreg
 *
 * Description:
 *   This function may to used to intercept an monitor all register accesses.
 *   Clearly this is nothing you would want to do unless you are debugging
 *   this driver.
 *
 * Input Parameters:
 *   val - The value to write to the register
 *   addr - The register address to read
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SDMMC_REGDEBUG
static void __esp32s3_putreg(const char *func, uint32_t val, uint32_t addr)
{
  /* Show the register value being written */

  mcerr("%s: %08x<-%08x\n", func, addr, val);

  /* Write the value */

  putreg32(val, addr);
}
#endif

/****************************************************************************
 * Name: esp32s3_ciu_sendcmd
 *
 * Description:
 *   Function to send command to Card interface unit (CIU)
 *
 * Input Parameters:
 *   cmd - The command to be executed
 *   arg - The argument to use with the command.
 *
 * Returned Value:
 *   Returns zero on success.  One will be returned on a timeout.
 *
 ****************************************************************************/

static int esp32s3_ciu_sendcmd(uint32_t cmd, uint32_t arg)
{
  clock_t watchtime;

  watchtime = clock_systime_ticks();

  while ((esp32s3_getreg(ESP32S3_SDMMC_CMD) & SDMMC_CMD_STARTCMD) != 0)
    {
      if (watchtime - clock_systime_ticks() > SDCARD_CMDTIMEOUT)
        {
          mcerr("TMO Timed out (%08" PRIX32 ")\n",
                esp32s3_getreg(ESP32S3_SDMMC_CMD));
          return 1;
        }
    }

  /* Set command arg reg */

  cmd |= SDMMC_CMD_STARTCMD | SDMMC_CMD_USE_HOLE;

  esp32s3_putreg(arg, ESP32S3_SDMMC_CMDARG);
  esp32s3_putreg(cmd, ESP32S3_SDMMC_CMD);

  mcinfo("cmd=0x%" PRIx32 " arg=0x%" PRIx32 "\n", cmd, arg);

