apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_sdmmc.c
#ifdef CONFIG_ESP32S3_SDMMC_DMA
static int esp32s3_fill_dma_desc(struct esp32s3_dev_s *priv)
{
  uint32_t ctrl;
  uint32_t maxs;
  int i = 0;
  size_t buflen = priv->remaining;
  uint32_t buffer = (uint32_t)priv->buffer;

#ifdef CONFIG_ESP32S3_SPIRAM
  if (!esp32s3_ptr_dma_capable(priv->buffer))
    {
      priv->dma_buf = kmm_memalign(16, buflen);
      if (!priv->dma_buf)
        {
          return -ENOMEM;
        }

      priv->dma_buf_size = buflen;
      buffer = (uint32_t)priv->dma_buf;

      if (priv->wrdir)
        {
          memcpy(priv->dma_buf, priv->buffer, buflen);
        }
    }
#endif

  /* Setup DMA list */

  while (buflen > 0)
    {
      /* Limit size of the transfer to maximum buffer size */

      maxs = buflen;

      if (maxs > MCI_DMADES1_MAXTR)
        {
          maxs = MCI_DMADES1_MAXTR;
        }

      buflen -= maxs;

      /* Set buffer size */

      priv->dma_desc[i].des1 = MCI_DMADES1_BS1(maxs);

      /* Setup buffer address (chained) */

      priv->dma_desc[i].des2 = buffer + (i * MCI_DMADES1_MAXTR);

      /* Setup basic control */

      ctrl = MCI_DMADES0_OWN | MCI_DMADES0_CH;

      if (i == 0)
        {
          ctrl |= MCI_DMADES0_FS; /* First DMA buffer */
        }

      /* No more data?  Then this is the last descriptor */

      if (buflen == 0)
        {
          ctrl |= MCI_DMADES0_LD;
          priv->dma_desc[i].des3 = 0;
        }
      else
        {
          ctrl |= MCI_DMADES0_DIC;
          priv->dma_desc[i].des3 = (uint32_t)&priv->dma_desc[i + 1];
        }

      priv->dma_desc[i].des0 = ctrl;
      i++;
    }

  DEBUGASSERT(i < NUM_DMA_DESCRIPTORS);

  return 0;
}
#endif

/****************************************************************************
 * Name: esp32s3_dmarecvsetup
 *
 * Description:
 *   Setup to perform a read DMA.  If the processor supports a data cache,
 *   then this method will also make sure that the contents of the DMA memory
 *   and the data cache are coherent.  For read transfers this may mean
 *   invalidating the data cache.
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *   buffer - The memory to DMA from
 *   buflen - The size of the DMA transfer in bytes
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SDMMC_DMA
static int esp32s3_dmarecvsetup(struct sdio_dev_s *dev, uint8_t *buffer,
                                size_t buflen)
{
  struct esp32s3_dev_s *priv = (struct esp32s3_dev_s *)dev;
  uint32_t regval;

  /* Don't bother with DMA if the entire transfer will fit in the RX FIFO or
   * if we do not have a 4-bit wide bus.
   */

  DEBUGASSERT(priv != NULL);

  DEBUGASSERT(buffer != NULL && buflen > 0 && ((uint32_t)buffer & 3) == 0);

  /* Save the destination buffer information for use by the interrupt
   * handler.
   */

  priv->buffer    = (uint32_t *)buffer;
  priv->remaining = buflen;
  priv->wrdir     = false;

  /* Setup DMA list */

  if (esp32s3_fill_dma_desc(priv))
    {
      return -ENOMEM;
    }

  /* Flush ints before we start */

  esp32s3_putreg(SDCARD_TRANSFER_ALL, ESP32S3_SDMMC_RINTSTS);

  /* Enable internal DMA, burst size of 4, fixed burst */

  regval  = esp32s3_getreg(ESP32S3_SDMMC_CTRL);
  regval |= SDMMC_CTRL_INTDMA;
  esp32s3_putreg(regval, ESP32S3_SDMMC_CTRL);

  regval = SDMMC_BMOD_DE | SDMMC_BMOD_FB;
  esp32s3_putreg(regval, ESP32S3_SDMMC_BMOD);

  esp32s3_putreg(1, ESP32S3_SDMMC_PLDMND);

  /* Setup DMA error interrupts */

  esp32s3_config_dmaints(priv, SDCARD_DMARECV_MASK, SDCARD_DMAERROR_MASK);
  return OK;
}
#endif

/****************************************************************************
 * Name: esp32s3_dmasendsetup
 *
 * Description:
 *   Setup to perform a write DMA.  If the processor supports a data cache,
 *   then this method will also make sure that the contents of the DMA memory
 *   and the data cache are coherent.  For write transfers, this may mean
 *   flushing the data cache.
 *
 * Input Parameters:
 *   dev    - An instance of the SDIO device interface
 *   buffer - The memory to DMA into
 *   buflen - The size of the DMA transfer in bytes
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SDMMC_DMA
static int esp32s3_dmasendsetup(struct sdio_dev_s *dev,
                                const uint8_t *buffer, size_t buflen)
{
  struct esp32s3_dev_s *priv = (struct esp32s3_dev_s *)dev;
  uint32_t regval;

  /* Don't bother with DMA if the entire transfer will fit in the TX FIFO or
   * if we do not have a 4-bit wide bus.
   */

  DEBUGASSERT(priv != NULL);

  mcinfo("buflen=%" PRIu32 "\n", (unsigned long)buflen);
  DEBUGASSERT(buffer != NULL && buflen > 0 && ((uint32_t)buffer & 3) == 0);

  /* Save the destination buffer information for use by the interrupt
   * handler.
   */

  priv->buffer    = (uint32_t *)buffer;
  priv->remaining = buflen;
  priv->wrdir     = true;

  /* Setup DMA descriptor list */

  if (esp32s3_fill_dma_desc(priv))
    {
      return -ENOMEM;
    }

  /* Flush ints before we start */

  esp32s3_putreg(SDCARD_TRANSFER_ALL, ESP32S3_SDMMC_RINTSTS);

  /* Enable internal DMA, fixed burst */

  regval  = esp32s3_getreg(ESP32S3_SDMMC_CTRL);
  regval |= SDMMC_CTRL_INTDMA;
  esp32s3_putreg(regval, ESP32S3_SDMMC_CTRL);

  regval = SDMMC_BMOD_DE | SDMMC_BMOD_FB;
  esp32s3_putreg(regval, ESP32S3_SDMMC_BMOD);
  esp32s3_putreg(1, ESP32S3_SDMMC_PLDMND);

  /* Setup DMA error interrupts */

  esp32s3_config_dmaints(priv, SDCARD_DMASEND_MASK, SDCARD_DMAERROR_MASK);
  return OK;
}
#endif

/****************************************************************************
 * Name: esp32s3_callback
 *
 * Description:
 *   Perform callback.
 *
 * Assumptions:
 *   This function does not execute in the context of an interrupt handler.
 *   It may be invoked on any user thread or scheduled on the work thread
 *   from an interrupt handler.
 *
 ****************************************************************************/

static void esp32s3_callback(void *arg)
{
  struct esp32s3_dev_s *priv = (struct esp32s3_dev_s *)arg;

  /* Is a callback registered? */

  DEBUGASSERT(priv != NULL);
  mcinfo("Callback %p(%p) cbevents: %02x cdstatus: %02x\n",
         priv->callback, priv->cbarg, priv->cbevents, priv->cdstatus);

