apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_sdmmc.c
  if (priv->callback)
    {
      /* Yes.. Check for enabled callback events */

      if ((priv->cdstatus & SDIO_STATUS_PRESENT) != 0)
        {
          /* Media is present.  Is the media inserted event enabled? */

          if ((priv->cbevents & SDIOMEDIA_INSERTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }
      else
        {
          /* Media is not present.  Is the media eject event enabled? */

          if ((priv->cbevents & SDIOMEDIA_EJECTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }

      /* Perform the callback, disabling further callbacks.  Of course, the
       * the callback can (and probably should) re-enable callbacks.
       */

      priv->cbevents = 0;

      /* Callbacks cannot be performed in the context of an interrupt
       * handler.  If we are in an interrupt handler, then queue the
       * callback to be performed later on the work thread.
       */

      if (up_interrupt_context())
        {
          /* Yes.. queue it */

           mcinfo("Queuing callback to %p(%p)\n",
                  priv->callback, priv->cbarg);
           work_queue(HPWORK, &priv->cbwork, priv->callback,
                      priv->cbarg, 0);
        }
      else
        {
          /* No.. then just call the callback here */

          mcinfo("Callback to %p(%p)\n", priv->callback, priv->cbarg);
          priv->callback(priv->cbarg);
        }
    }
}

const static sdmmc_slot_info_t sdmmc_slot_info[] =
{
    {
      .card_detect = SDHOST_CARD_DETECT_N_1_IDX,
      .write_protect = SDHOST_CARD_WRITE_PRT_1_IDX,
      .card_int = SDHOST_CARD_INT_N_1_IDX,
    },

    {
      .card_detect = SDHOST_CARD_DETECT_N_2_IDX,
      .write_protect = SDHOST_CARD_WRITE_PRT_2_IDX,
      .card_int = SDHOST_CARD_INT_N_2_IDX,
    }
};

const static sdmmc_slot_io_info_t sdmmc_slot_gpio_sig[] =
{
    {
      .clk = SDHOST_CCLK_OUT_1_IDX,
      .cmd = SDHOST_CCMD_OUT_1_IDX,
      .d0 = SDHOST_CDATA_OUT_10_IDX,
      .d1 = SDHOST_CDATA_OUT_11_IDX,
      .d2 = SDHOST_CDATA_OUT_12_IDX,
      .d3 = SDHOST_CDATA_OUT_13_IDX,
      .d4 = SDHOST_CDATA_OUT_14_IDX,
      .d5 = SDHOST_CDATA_OUT_15_IDX,
      .d6 = SDHOST_CDATA_OUT_16_IDX,
      .d7 = SDHOST_CDATA_OUT_17_IDX,
    },

    {
      .clk = SDHOST_CCLK_OUT_2_IDX,
      .cmd = SDHOST_CCMD_OUT_2_IDX,
      .d0 = SDHOST_CDATA_OUT_20_IDX,
      .d1 = SDHOST_CDATA_OUT_21_IDX,
      .d2 = SDHOST_CDATA_OUT_22_IDX,
      .d3 = SDHOST_CDATA_OUT_23_IDX,
      .d4 = SDHOST_CDATA_OUT_24_IDX,
      .d5 = SDHOST_CDATA_OUT_25_IDX,
      .d6 = SDHOST_CDATA_OUT_26_IDX,
      .d7 = SDHOST_CDATA_OUT_27_IDX,
    }
};

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: sdio_initialize
 *
 * Description:
 *   Initialize SDIO for operation.
 *
 * Input Parameters:
 *   slotno - Not used.
 *
 * Returned Value:
 *   A reference to an SDIO interface structure.  NULL is returned on
 *   failures.
 *
 ****************************************************************************/

struct sdio_dev_s *sdio_initialize(int slotno)
{
  uint32_t regval;

  struct esp32s3_dev_s *priv = &g_sdiodev;

  priv->slot = slotno;
  priv->slot_info = &sdmmc_slot_info[slotno];
  priv->sdio_pins = &sdmmc_slot_gpio_sig[slotno];

  /* enable bus clock */

  regval = esp32s3_getreg(SYSTEM_PERIP_CLK_EN1_REG);
  regval |= SYSTEM_SDIO_HOST_CLK_EN;
  esp32s3_putreg(regval, SYSTEM_PERIP_CLK_EN1_REG);

  /* reset registers */

  regval = esp32s3_getreg(SYSTEM_PERIP_RST_EN1_REG);
  regval |= SYSTEM_SDIO_HOST_RST;
  esp32s3_putreg(regval, SYSTEM_PERIP_RST_EN1_REG);
  regval &= ~SYSTEM_SDIO_HOST_RST;
  esp32s3_putreg(regval, SYSTEM_PERIP_RST_EN1_REG);

  /* Reset */

  priv->dev.reset(&priv->dev);

  /* Pin configuration */

  configure_pin(CONFIG_ESP32S3_SDMMC_CLK, priv->sdio_pins->clk, OUTPUT);
  configure_pin(CONFIG_ESP32S3_SDMMC_CMD, priv->sdio_pins->cmd,
                INPUT | OUTPUT | PULLUP);
  configure_pin(CONFIG_ESP32S3_SDMMC_D0, priv->sdio_pins->d0,
                INPUT | OUTPUT | PULLUP);

  esp_gpio_matrix_in(GPIO_MATRIX_CONST_ONE_INPUT,
                         priv->slot_info->card_int, false);
  esp_gpio_matrix_in(GPIO_MATRIX_CONST_ZERO_INPUT,
                         priv->slot_info->card_detect, false);
  esp_gpio_matrix_in(GPIO_MATRIX_CONST_ONE_INPUT,
                         priv->slot_info->write_protect, true);

  return &priv->dev;
}

#endif /* CONFIG_ESP32S3_SDMMC */
